#include "Scene_Game.h"

#include <ModelManager.h>


/// ===================================================
/// 初期化処理
/// ===================================================
void Scene_Game::Initialize() {

	model_ = ModelManager::CreateCube();

}


/// ===================================================
/// 更新処理
/// ===================================================
void Scene_Game::Update() {

	rotate_.y += 1.0f / 60.0f;
	model_->SetRotate(rotate_);

}


/// ===================================================
/// 描画処理
/// ===================================================
void Scene_Game::Draw() {

	model_->Draw();

}
