#pragma once

/// ===================================================
/// CSのPSOクラス
/// ===================================================
class ComputePipelineState {
public:

	/// ===================================================
	/// public : methods
	/// ===================================================

	ComputePipelineState();
	~ComputePipelineState();

	void Create();

	void CreateRootSignature();

private:

	/// ===================================================
	/// private : objects
	/// ===================================================


};