#include <ModelManager.h>



/// ===================================================
/// インスタンス確保
/// ===================================================
ModelManager* ModelManager::GetInstance() {
	static ModelManager instance;
	return &instance;
}


/// ===================================================
/// 描画前処理
/// ===================================================
void ModelManager::PreDraw() {

}


/// ===================================================
/// 描画後処理
/// ===================================================
void ModelManager::PostDraw() {

}
