#pragma once

/// engine
#include "Engine/Asset/Guid/Guid.h"

namespace ONEngine {

/// ///////////////////////////////////////////////////
/// Assetを共通化するためのインターフェース
/// ///////////////////////////////////////////////////
class IAsset {
public:
	/// ==================================================
	/// public : methods
	/// ==================================================

	IAsset() = default;
	virtual ~IAsset() = default;

	/// ==================================================
	/// public : objects
	/// ==================================================

	Guid guid;
};

} /// ONEngine
